[
    {
        "id": 7,
        "title": "Butler Machine Walkthrough - Jenkins & Windows Privilege Escalation",
        "category": "walkthrough",
        "excerpt": "Complete Windows penetration test exploiting Jenkins with weak credentials, Groovy reverse shell execution, and privilege escalation via unquoted service path vulnerability.",
        "content": "<h3>Overview</h3><p>This comprehensive walkthrough demonstrates exploiting a Jenkins server to gain initial access, then escalating privileges on Windows through an unquoted service path vulnerability. The tutorial covers reconnaissance using Nmap, password spraying attacks with Burp Suite, Jenkins Script Console exploitation, Groovy reverse shell execution, Windows enumeration with WinPEAS, and privilege escalation through unquoted service paths. You'll learn how to identify and exploit service misconfigurations, transfer files to Windows targets, and leverage common Windows vulnerabilities. This walkthrough includes detailed explanations of each step, command examples, and screenshots demonstrating the entire attack chain from initial access to SYSTEM privileges. Perfect for those learning Windows penetration testing, Jenkins exploitation, and privilege escalation techniques in a practical environment.</p><p><a href='Walthroughs/Butler/butler-walkthrough.html' style='color: var(--primary-color);'>Read the full walkthrough →</a></p>",
        "image": "https://images.unsplash.com/photo-1614064641938-3bbee52942c7?w=800&h=400&fit=crop",
        "date": "2025-12-03",
        "isExternal": true,
        "externalLink": "Walthroughs/Butler/butler-walkthrough.html"
    },
    {
        "id": 6,
        "title": "Dev Machine Walkthrough - NFS, LFI & Privilege Escalation",
        "category": "walkthrough",
        "excerpt": "Advanced penetration testing walkthrough covering NFS enumeration, Local File Inclusion exploitation, password cracking, and privilege escalation via sudo zip abuse.",
        "content": "<h3>Overview</h3><p>This comprehensive walkthrough demonstrates multiple sophisticated attack vectors on the Dev machine, combining various penetration testing techniques. The tutorial covers NFS service enumeration and mounting, BoltWire CMS exploitation through Local File Inclusion vulnerabilities, directory enumeration to discover exposed configuration files, password-protected archive cracking with fcrackzip, SSH private key extraction and usage, and privilege escalation through sudo abuse using GTFOBins techniques. You'll learn how to chain multiple vulnerabilities together, from initial reconnaissance through Nmap scanning to achieving root access. The walkthrough includes detailed command examples, tool usage demonstrations, and strategic decision-making processes that penetration testers use in real-world scenarios. Perfect for intermediate learners looking to enhance their Linux exploitation and privilege escalation skills.</p><p><a href='Walthroughs/Dev/dev-walkthrough.html' style='color: var(--primary-color);'>Read the full walkthrough →</a></p>",
        "image": "https://images.unsplash.com/photo-1558494949-ef010cbdcc31?w=800&h=400&fit=crop",
        "date": "2025-11-30",
        "isExternal": true,
        "externalLink": "Walthroughs/Dev/dev-walkthrough.html"
    },
    {
        "id": 5,
        "title": "Academy Machine Walkthrough - Complete Penetration Test",
        "category": "walkthrough",
        "excerpt": "Full penetration testing walkthrough of the Academy machine. Learn reconnaissance, hash cracking, PHP exploitation, and privilege escalation via cron job abuse.",
        "content": "<h3>Overview</h3><p>This comprehensive walkthrough covers the complete penetration test of the Academy machine from initial reconnaissance to root access. The tutorial demonstrates FTP service enumeration with anonymous login capabilities, hash identification and cracking using hash-identifier and hashcat, web service enumeration and directory fuzzing with ffuf, PHP student portal exploitation, reverse shell upload techniques using pentestmonkey's PHP reverse shell, Linux enumeration with LinPEAS for privilege escalation opportunities, database credential discovery in configuration files, SSH access with discovered credentials, cron job analysis using pspy for scheduled task monitoring, and privilege escalation through cron job manipulation by injecting malicious bash reverse shells. This walkthrough provides a methodical approach to penetration testing, demonstrating how to systematically exploit discovered vulnerabilities and chain them together to achieve full system compromise.</p><p><a href='Walthroughs/Academy/academy-walkthrough.html' style='color: var(--primary-color);'>Read the full walkthrough →</a></p>",
        "image": "https://images.unsplash.com/photo-1555949963-ff9fe0c870eb?w=800&h=400&fit=crop",
        "date": "2025-11-29",
        "isExternal": true,
        "externalLink": "Walthroughs/Academy/academy-walkthrough.html"
    },
    {
        "id": 4,
        "title": "Blue Machine Walkthrough - EternalBlue Exploit",
        "category": "walkthrough",
        "excerpt": "Complete step-by-step walkthrough exploiting the EternalBlue vulnerability (MS17-010) on a Windows machine using Metasploit Framework.",
        "content": "<h3>Overview</h3><p>This walkthrough demonstrates how to exploit the infamous EternalBlue vulnerability (MS17-010) on a Windows 7 machine, one of the most critical vulnerabilities in recent history. The tutorial covers network configuration and connectivity verification between attack and target machines, comprehensive Nmap reconnaissance to identify open SMB ports and service versions, vulnerability research to confirm the presence of MS17-010, Metasploit Framework exploitation using the EternalBlue module, post-exploitation techniques including hash dumping with hashdump command, and understanding the impact of this critical SMB vulnerability. You'll learn the complete exploitation workflow from reconnaissance to credential harvesting, including how to verify vulnerability presence before exploitation and proper use of the Metasploit framework. This walkthrough is perfect for beginners learning Windows exploitation and understanding historical critical vulnerabilities that shaped modern cybersecurity practices.</p><p><a href='Walthroughs/Blue/blue-walkthrough.html' style='color: var(--primary-color);'>Read the full walkthrough →</a></p>",
        "image": "https://images.unsplash.com/photo-1629654291663-b91ad427698f?w=800&h=400&fit=crop",
        "date": "2025-11-28",
        "isExternal": true,
        "externalLink": "Walthroughs/Blue/blue-walkthrough.html"
    }
]
